emacs/setup/functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>functions</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">functions</h1>
<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">- delete-duplicate-lines</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- transpose-windows</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- toggle-current-window-dedication</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- remove-dos-eol</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- ido-bookmark-jump</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- unfill-paragraph</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- org-begin-template</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- xah-new-empty-buffer</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- insert-todays-date</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">- ido-bookmark-insert</span>

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">delete-duplicate-lines ;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">delete-duplicate-lines</span> (beg end)
  (<span class="org-keyword">interactive</span> <span class="org-string">"r"</span>)
  (<span class="org-keyword">let</span> ((lines (split-string (buffer-substring beg end) <span class="org-string">"\n"</span>)))
    (delete-region beg end)
    (insert
     (mapconcat #'identity (delete-dups lines) <span class="org-string">"\n"</span>))))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">transpose-windows ;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">transpose-windows</span> (arg)
  <span class="org-doc">"Transpose the buffers shown in two windows."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"p"</span>)
  (<span class="org-keyword">let</span> ((selector (<span class="org-keyword">if</span> (&gt;= arg 0) 'next-window 'previous-window)))
    (<span class="org-keyword">while</span> (/= arg 0)
      (<span class="org-keyword">let</span> ((this-win (window-buffer))
            (next-win (window-buffer (funcall selector))))
        (set-window-buffer (selected-window) next-win)
        (set-window-buffer (funcall selector) this-win)
        (select-window (funcall selector)))
      (<span class="org-keyword">setq</span> arg (<span class="org-keyword">if</span> (plusp arg) (1- arg) (1+ arg))))))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;; </span><span class="org-comment">toggle-current-window-dedication ;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">toggle-current-window-dedication</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((window    (selected-window))
         (dedicated (window-dedicated-p window)))
    (set-window-dedicated-p window (not dedicated))
    (message <span class="org-string">"Window %sdedicated to %s"</span>
             (<span class="org-keyword">if</span> dedicated <span class="org-string">"no longer "</span> <span class="org-string">""</span>)
             (buffer-name))))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">remove-dos-eol ;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">http://stackoverflow.com/questions/730751/hiding-m-in-emacs</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">remove-dos-eol</span> ()
  <span class="org-doc">"Do not show ^M in files containing mixed UNIX and DOS line endings."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">setq</span> buffer-display-table (make-display-table))
  (aset buffer-display-table ?\^M []))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">ido-bookmark-jump ;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">require</span> '<span class="org-constant">bookmark</span>)
 (<span class="org-keyword">defun</span> <span class="org-function-name">ido-bookmark-jump</span> (bname)
    <span class="org-doc">"*Switch to bookmark interactively using `</span><span class="org-doc"><span class="org-constant">ido</span></span><span class="org-doc">'."</span>
    (<span class="org-keyword">interactive</span> (list (ido-completing-read <span class="org-string">"Bookmark: "</span> (bookmark-all-names) nil t)))
    (bookmark-jump bname))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">unfill-paragraph ;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Stefan Monnier . It is the opposite of fill-paragraph</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">unfill-paragraph</span> (<span class="org-type">&amp;optional</span> region)
  <span class="org-doc">"Takes a multi-line paragraph and makes it into a single line of text."</span>
  (<span class="org-keyword">interactive</span> (<span class="org-keyword">progn</span> (barf-if-buffer-read-only) '(t)))
  (<span class="org-keyword">let</span> ((fill-column (point-max)))
    (fill-paragraph nil region)))

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">org-begin-template ;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">http://pragmaticemacs.com/author/bjm/page/3/</span>

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">function to wrap blocks of text in org templates                       ;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">e.g. latex or src etc                                                  ;;</span>
<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">org-begin-template</span> ()
  <span class="org-doc">"Make a template at point."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (org-at-table-p)
      (call-interactively 'org-table-rotate-recalc-marks)
    (<span class="org-keyword">let*</span> ((choices '((<span class="org-string">"s"</span> . <span class="org-string">"SRC"</span>)
                      (<span class="org-string">"e"</span> . <span class="org-string">"EXAMPLE"</span>)
                      (<span class="org-string">"q"</span> . <span class="org-string">"QUOTE"</span>)
                      (<span class="org-string">"v"</span> . <span class="org-string">"VERSE"</span>)
                      (<span class="org-string">"c"</span> . <span class="org-string">"CENTER"</span>)
                      (<span class="org-string">"l"</span> . <span class="org-string">"LaTeX"</span>)
                      (<span class="org-string">"h"</span> . <span class="org-string">"HTML"</span>)
                      (<span class="org-string">"a"</span> . <span class="org-string">"ASCII"</span>)))
           (key
            (key-description
             (vector
              (read-key
               (concat (propertize <span class="org-string">"Template type: "</span> 'face 'minibuffer-prompt)
                       (mapconcat (<span class="org-keyword">lambda</span> (choice)
                                    (concat (propertize (car choice) 'face 'font-lock-type-face)
                                            <span class="org-string">": "</span>
                                            (cdr choice)))
                                  choices
                                  <span class="org-string">", "</span>)))))))
      (<span class="org-keyword">let</span> ((result (assoc key choices)))
        (<span class="org-keyword">when</span> result
          (<span class="org-keyword">let</span> ((choice (cdr result)))
            (<span class="org-keyword">cond</span>
             ((region-active-p)
              (<span class="org-keyword">let</span> ((start (region-beginning))
                    (end (region-end)))
                (goto-char end)
                (insert <span class="org-string">"#+END_"</span> choice <span class="org-string">"\n"</span>)
                (goto-char start)
                (insert <span class="org-string">"#+BEGIN_"</span> choice <span class="org-string">"\n"</span>)))
             (t
              (insert <span class="org-string">"#+BEGIN_"</span> choice <span class="org-string">"\n"</span>)
              (<span class="org-keyword">save-excursion</span> (insert <span class="org-string">"#+END_"</span> choice))))))))))

<span class="org-comment-delimiter">;;</span><span class="org-comment">bind to key</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">(define-key org-mode-map (kbd "C-&lt;") 'org-begin-template) !!!</span>

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">xah-new-empty-buffer ;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">xah-new-empty-buffer</span> ()
  <span class="org-doc">"Open a new empty buffer.</span>
<span class="org-doc">URL `</span><span class="org-doc"><span class="org-constant">http://ergoemacs.org/emacs/emacs_new_empty_buffer.html</span></span><span class="org-doc">'</span>
<span class="org-doc">Version 2015-06-12"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((xahbuf (generate-new-buffer <span class="org-string">"untitled"</span>)))
    (switch-to-buffer xahbuf)
    (funcall (<span class="org-keyword">and</span> initial-major-mode))
    (<span class="org-keyword">setq</span> buffer-offer-save t)))

(global-set-key (kbd <span class="org-string">"&lt;f6&gt;"</span>) 'xah-new-empty-buffer)

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">insert-todays-date ;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">from http://emacswiki.org/emacs/InsertingTodaysDate</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">insert-todays-date</span> (arg)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (insert (<span class="org-keyword">if</span> arg
              (format-time-string <span class="org-string">"%d-%m-%Y"</span>)
            (format-time-string <span class="org-string">"%Y-%m-%d %a %H:%M"</span>))))

(global-set-key (kbd <span class="org-string">"&lt;f5&gt;"</span>) 'insert-todays-date)

<span class="org-comment-delimiter">;;;;;;;;;;;;;;;;;;;;;;;; </span><span class="org-comment">ido-bookmark-insert ;;;;;;;;;;;;;;;;;;;;;;;;;</span>
(<span class="org-keyword">require</span> '<span class="org-constant">bookmark</span>)
 (<span class="org-keyword">defun</span> <span class="org-function-name">ido-bookmark-insert</span> (bname)
    <span class="org-doc">"*Insert to bookmark interactively using `</span><span class="org-doc"><span class="org-constant">ido</span></span><span class="org-doc">'."</span>
    (<span class="org-keyword">interactive</span> (list (ido-completing-read <span class="org-string">"Bookmark: "</span> (bookmark-all-names) nil t)))
    (bookmark-insert bname))

(global-set-key (kbd <span class="org-string">"H-i"</span>) 'ido-bookmark-insert)
</pre>
</div>

<p>
<a href="../setup.html">back</a>
</p>
</div>
</body>
</html>
